---
kind: type
id: T:Autodesk.Revit.DB.Architecture.GutterType
source: html/572b736f-1533-b759-7a9e-55ed1ff2709b.htm
---
# Autodesk.Revit.DB.Architecture.GutterType

An object that represents the gutter type
in Autodesk Revit.

## Syntax (C#)
```csharp
public class GutterType : HostedSweepType
```